This Google Colab Notebook contains a project on Python-SQLite Connection where the SQLite database is not already installed. This is made possible because SQLite is embedded in the Python Programming Langauge. No need for a standalone installation.

In [1]:
# Import sqlite3 library
import sqlite3

In [2]:
# Create a connection object
conn = sqlite3.connect('hr.db')
print("Opened database successfully")

Opened database successfully

In [3]:
# Check the version of the sqlite libary
sqlite3.version

'2.6.0'

In [4]:
# Create a cursor object
c = conn.cursor()

In [5]:
# Define a function to check if a table exists
def table_check(table_name):
    c.execute("""SELECT count(name) FROM sqlite_master WHERE type='table' AND name='{}'""".format(table_name))
    if c.fetchone()[0] == 1:
        return True
    return False

---
Check if the tables already exist.

In [6]:
table_check('regions')

False

In [7]:
table_check('countries')

False

In [8]:
table_check('locations')

False

In [9]:
table_check('jobs')

False

In [10]:
table_check('departments')

False

In [11]:
table_check('employees')

False

In [12]:
table_check('dependents')

False

---
### Using `for loop` to check the existing tables

In [13]:
# Define a function to check if a table exists
def table_check(table_name):
    c.execute("""SELECT count(name) FROM sqlite_master WHERE type='table' AND name='{}'""".format(table_name))
    if c.fetchone()[0] == 1:
        return True
    return False

# List of your seven table names
tables = ['regions', 'countries', 'locations', 'jobs', 'departments', 'employees', 'dependents']

# Loop through the table names and check if each table exists
for table in tables:
    if table_check(table):
        print(f"Table '{table}' exists.")
    else:
        print(f"Table '{table}' does not exist.")

Table 'regions' does not exist.
Table 'countries' does not exist.
Table 'locations' does not exist.
Table 'jobs' does not exist.
Table 'departments' does not exist.
Table 'employees' does not exist.
Table 'dependents' does not exist.

___
The tables don't exist in the database, so we create them.

---
## Table Creation

In [14]:
# Check if a table exists, and create it if it doesn't
if not table_check('regions'):
  c.execute('''CREATE TABLE regions (
	region_id INT IDENTITY(1,1) PRIMARY KEY,
	region_name VARCHAR (25) DEFAULT NULL
);''')

In [15]:
# Check if a table exists, and create it if it doesn't
if not table_check('countries'):
  c.execute('''CREATE TABLE countries (
	country_id CHAR (2) PRIMARY KEY,
	country_name VARCHAR (40) DEFAULT NULL,
	region_id INT NOT NULL,
	FOREIGN KEY (region_id) REFERENCES regions (region_id) ON DELETE CASCADE ON UPDATE CASCADE
);
''')

In [16]:
# Check if a table exists, and create it if it doesn't
if not table_check('locations'):
  c.execute('''CREATE TABLE locations (
	location_id INT IDENTITY(1,1) PRIMARY KEY,
	street_address VARCHAR (40) DEFAULT NULL,
	postal_code VARCHAR (12) DEFAULT NULL,
	city VARCHAR (30) NOT NULL,
	state_province VARCHAR (25) DEFAULT NULL,
	country_id CHAR (2) NOT NULL,
	FOREIGN KEY (country_id) REFERENCES countries (country_id) ON DELETE CASCADE ON UPDATE CASCADE
);

''')

In [17]:
# Check if a table exists, and create it if it doesn't
if not table_check('jobs'):
  c.execute('''CREATE TABLE jobs (
	job_id INT IDENTITY(1,1) PRIMARY KEY,
	job_title VARCHAR (35) NOT NULL,
	min_salary DECIMAL (8, 2) DEFAULT NULL,
	max_salary DECIMAL (8, 2) DEFAULT NULL
);

''')

In [18]:
# Check if a table exists, and create it if it doesn't
if not table_check('departments'):
  c.execute('''CREATE TABLE departments (
	department_id INT IDENTITY(1,1) PRIMARY KEY,
	department_name VARCHAR (30) NOT NULL,
	location_id INT DEFAULT NULL,
	FOREIGN KEY (location_id) REFERENCES locations (location_id) ON DELETE CASCADE ON UPDATE CASCADE
);


''')

In [19]:
# Check if a table exists, and create it if it doesn't
if not table_check('employees'):
  c.execute('''CREATE TABLE employees (
	employee_id INT IDENTITY(1,1) PRIMARY KEY,
	first_name VARCHAR (20) DEFAULT NULL,
	last_name VARCHAR (25) NOT NULL,
	email VARCHAR (100) NOT NULL,
	phone_number VARCHAR (20) DEFAULT NULL,
	hire_date DATE NOT NULL,
	job_id INT NOT NULL,
	salary DECIMAL (8, 2) NOT NULL,
	manager_id INT DEFAULT NULL,
	department_id INT DEFAULT NULL,
	FOREIGN KEY (job_id) REFERENCES jobs (job_id) ON DELETE CASCADE ON UPDATE CASCADE,
	FOREIGN KEY (department_id) REFERENCES departments (department_id) ON DELETE CASCADE ON UPDATE CASCADE,
	FOREIGN KEY (manager_id) REFERENCES employees (employee_id)
);



''')

In [20]:
# Check if a table exists, and create it if it doesn't
if not table_check('dependents'):
  c.execute('''CREATE TABLE dependents (
	dependent_id INT IDENTITY(1,1) PRIMARY KEY,
	first_name VARCHAR (50) NOT NULL,
	last_name VARCHAR (50) NOT NULL,
	relationship VARCHAR (25) NOT NULL,
	employee_id INT NOT NULL,
	FOREIGN KEY (employee_id) REFERENCES employees (employee_id) ON DELETE CASCADE ON UPDATE CASCADE
);

''')

In [21]:
# Check if the tables exist again
def table_check(table_name):
    c.execute("""SELECT count(name) FROM sqlite_master WHERE type='table' AND name='{}'""".format(table_name))
    if c.fetchone()[0] == 1:
        return True
    return False

# List of your seven table names
tables = ['regions', 'countries', 'locations', 'jobs', 'departments', 'employees', 'dependents']

# Loop through the table names and check if each table exists
for table in tables:
    if table_check(table):
        print(f"Table '{table}' exists.")
    else:
        print(f"Table '{table}' does not exist.")

Table 'regions' exists.
Table 'countries' exists.
Table 'locations' exists.
Table 'jobs' exists.
Table 'departments' exists.
Table 'employees' exists.
Table 'dependents' exists.

### Inspecting table structure

In [24]:
c.execute("PRAGMA table_info(regions);")
for row in c.fetchall():
    print(row)

(0, 'region_id', 'INT IDENTITY(1,1)', 0, None, 1)
(1, 'region_name', 'VARCHAR (25)', 0, 'NULL', 0)

---
## Inserting Records

### REGIONS

In [25]:
c.execute('''INSERT INTO regions(region_id,region_name) VALUES (1,'Europe');
''')

In [26]:
c.execute('''INSERT INTO regions(region_id,region_name) VALUES (2,'Americas');
''')

In [27]:
c.execute('''INSERT INTO regions(region_id,region_name) VALUES (3,'Asia');
''')

In [28]:
c.execute('''INSERT INTO regions(region_id,region_name) VALUES (4,'Middle East and Africa');
''')

### COUNTRIES

In [31]:
c.execute('''INSERT INTO countries(country_id,country_name,region_id) VALUES ('AR','Argentina',2);
''')

IntegrityError: UNIQUE constraint failed: countries.country_id

In [32]:
c.execute('''INSERT INTO countries(country_id,country_name,region_id) VALUES ('AU','Australia',3);
''')

IntegrityError: UNIQUE constraint failed: countries.country_id

In [33]:
c.execute('''INSERT INTO countries(country_id,country_name,region_id) VALUES ('BE','Belgium',1);
''')

In [34]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('BR', 'Brazil', 2);")

In [35]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('CA', 'Canada', 2);")

In [36]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('CH', 'Switzerland', 1);")

In [37]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('CN', 'China', 3);")

In [38]:

c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('DE', 'Germany', 1);")

In [40]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('DK', 'Denmark', 1);")

In [39]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('EG', 'Egypt', 4);")

In [41]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('FR', 'France', 1);")

In [42]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('HK', 'HongKong', 3);")

In [43]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('IL', 'Israel', 4);")

In [44]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('IN', 'India', 3);")

In [45]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('IT', 'Italy', 1);")

In [46]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('JP', 'Japan', 3);")

In [47]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('KW', 'Kuwait', 4);")

In [48]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('MX', 'Mexico', 2);")

In [49]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('NG', 'Nigeria', 4);")

In [50]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('NL', 'Netherlands', 1);")

In [51]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('SG', 'Singapore', 3);")

In [52]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('UK', 'United Kingdom', 1);")

In [53]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('US', 'United States of America', 2);")

In [54]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('ZM', 'Zambia', 4);")

In [55]:
c.execute("INSERT INTO countries(country_id, country_name, region_id) VALUES ('ZW', 'Zimbabwe', 4);")

---
### Insert with `for loop` and `parameterized queries`
 A better approach to inserting records is using for loop and parameterized queries
 So, going forward, we will use for loop to execute insert

### Regions

In [56]:
# List of regions as tuples (region_id, region_name)
regions = [
    (1, 'Europe'),
    (2, 'Americas'),
    (3, 'Asia'),
    (4, 'Middle East and Africa')
]

# Loop through the regions list and execute the insert query
for region in regions:
    c.execute("INSERT INTO regions (region_id, region_name) VALUES (?, ?);", region)

IntegrityError: UNIQUE constraint failed: regions.region_id

The table `Regions` is already populated using the first method.

### Countries

In [57]:
# List of countries as tuples (country_id, country_name, region_id)
countries = [
    ('AR', 'Argentina', 2),
    ('AU', 'Australia', 3),
    ('BE', 'Belgium', 1),
    ('BR', 'Brazil', 2),
    ('CA', 'Canada', 2),
    ('CH', 'Switzerland', 1),
    ('CN', 'China', 3),
    ('DE', 'Germany', 1),
    ('DK', 'Denmark', 1),
    ('EG', 'Egypt', 4),
    ('FR', 'France', 1),
    ('HK', 'HongKong', 3),
    ('IL', 'Israel', 4),
    ('IN', 'India', 3),
    ('IT', 'Italy', 1),
    ('JP', 'Japan', 3),
    ('KW', 'Kuwait', 4),
    ('MX', 'Mexico', 2),
    ('NG', 'Nigeria', 4),
    ('NL', 'Netherlands', 1),
    ('SG', 'Singapore', 3),
    ('UK', 'United Kingdom', 1),
    ('US', 'United States of America', 2),
    ('ZM', 'Zambia', 4),
    ('ZW', 'Zimbabwe', 4)
]

# Loop through the countries list and execute the insert query
for country in countries:
    c.execute("INSERT INTO countries (country_id, country_name, region_id) VALUES (?, ?, ?);", country)

IntegrityError: UNIQUE constraint failed: countries.country_id

The table `Countries` is already populated using the first method.

### Locations

In [58]:
# List of locations as tuples (location_id, street_address, postal_code, city, state_province, country_id)
locations = [
    (1400, '2014 Jabberwocky Rd', '26192', 'Southlake', 'Texas', 'US'),
    (1500, '2011 Interiors Blvd', '99236', 'South San Francisco', 'California', 'US'),
    (1700, '2004 Charade Rd', '98199', 'Seattle', 'Washington', 'US'),
    (1800, '147 Spadina Ave', 'M5V 2L7', 'Toronto', 'Ontario', 'CA'),
    (2400, '8204 Arthur St', None, 'London', None, 'UK'),
    (2500, 'Magdalen Centre, The Oxford Science Park', 'OX9 9ZB', 'Oxford', 'Oxford', 'UK'),
    (2700, 'Schwanthalerstr. 7031', '80925', 'Munich', 'Bavaria', 'DE')
]

# Loop through the locations list and execute the insert query
for location in locations:
    c.execute("""
        INSERT INTO locations (location_id, street_address, postal_code, city, state_province, country_id)
        VALUES (?, ?, ?, ?, ?, ?);
    """, location)

### Jobs

In [59]:
# List of jobs as tuples (job_id, job_title, min_salary, max_salary)
jobs = [
    (1, 'Public Accountant', 4200.00, 9000.00),
    (2, 'Accounting Manager', 8200.00, 16000.00),
    (3, 'Administration Assistant', 3000.00, 6000.00),
    (4, 'President', 20000.00, 40000.00),
    (5, 'Administration Vice President', 15000.00, 30000.00),
    (6, 'Accountant', 4200.00, 9000.00),
    (7, 'Finance Manager', 8200.00, 16000.00),
    (8, 'Human Resources Representative', 4000.00, 9000.00),
    (9, 'Programmer', 4000.00, 10000.00),
    (10, 'Marketing Manager', 9000.00, 15000.00),
    (11, 'Marketing Representative', 4000.00, 9000.00),
    (12, 'Public Relations Representative', 4500.00, 10500.00),
    (13, 'Purchasing Clerk', 2500.00, 5500.00),
    (14, 'Purchasing Manager', 8000.00, 15000.00),
    (15, 'Sales Manager', 10000.00, 20000.00),
    (16, 'Sales Representative', 6000.00, 12000.00),
    (17, 'Shipping Clerk', 2500.00, 5500.00),
    (18, 'Stock Clerk', 2000.00, 5000.00),
    (19, 'Stock Manager', 5500.00, 8500.00)
]

# Loop through the jobs list and execute the insert query
for job in jobs:
    c.execute("""
        INSERT INTO jobs (job_id, job_title, min_salary, max_salary)
        VALUES (?, ?, ?, ?);
    """, job)

### Departments

In [60]:
# List of departments as tuples (department_id, department_name, location_id)
departments = [
    (1, 'Administration', 1700),
    (2, 'Marketing', 1800),
    (3, 'Purchasing', 1700),
    (4, 'Human Resources', 2400),
    (5, 'Shipping', 1500),
    (6, 'IT', 1400),
    (7, 'Public Relations', 2700),
    (8, 'Sales', 2500),
    (9, 'Executive', 1700),
    (10, 'Finance', 1700),
    (11, 'Accounting', 1700)
]

# Loop through the departments list and execute the insert query
for department in departments:
    c.execute("""
        INSERT INTO departments (department_id, department_name, location_id)
        VALUES (?, ?, ?);
    """, department)

### Employees

In [61]:
# List of employees as tuples
employees = [
    (100, 'Steven', 'King', 'steven.king@sqltutorial.org', '515.123.4567', '1987-06-17', 4, 24000.00, None, 9),
    (101, 'Neena', 'Kochhar', 'neena.kochhar@sqltutorial.org', '515.123.4568', '1989-09-21', 5, 17000.00, 100, 9),
    (102, 'Lex', 'De Haan', 'lex.de haan@sqltutorial.org', '515.123.4569', '1993-01-13', 5, 17000.00, 100, 9),
    (103, 'Alexander', 'Hunold', 'alexander.hunold@sqltutorial.org', '590.423.4567', '1990-01-03', 9, 9000.00, 102, 6),
    (104, 'Bruce', 'Ernst', 'bruce.ernst@sqltutorial.org', '590.423.4568', '1991-05-21', 9, 6000.00, 103, 6),
    (105, 'David', 'Austin', 'david.austin@sqltutorial.org', '590.423.4569', '1997-06-25', 9, 4800.00, 103, 6),
    (106, 'Valli', 'Pataballa', 'valli.pataballa@sqltutorial.org', '590.423.4560', '1998-02-05', 9, 4800.00, 103, 6),
    (107, 'Diana', 'Lorentz', 'diana.lorentz@sqltutorial.org', '590.423.5567', '1999-02-07', 9, 4200.00, 103, 6),
    (108, 'Nancy', 'Greenberg', 'nancy.greenberg@sqltutorial.org', '515.124.4569', '1994-08-17', 7, 12000.00, 101, 10),
    (109, 'Daniel', 'Faviet', 'daniel.faviet@sqltutorial.org', '515.124.4169', '1994-08-16', 6, 9000.00, 108, 10),
    (110, 'John', 'Chen', 'john.chen@sqltutorial.org', '515.124.4269', '1997-09-28', 6, 8200.00, 108, 10),
    (111, 'Ismael', 'Sciarra', 'ismael.sciarra@sqltutorial.org', '515.124.4369', '1997-09-30', 6, 7700.00, 108, 10),
    (112, 'Jose Manuel', 'Urman', 'jose manuel.urman@sqltutorial.org', '515.124.4469', '1998-03-07', 6, 7800.00, 108, 10),
    (113, 'Luis', 'Popp', 'luis.popp@sqltutorial.org', '515.124.4567', '1999-12-07', 6, 6900.00, 108, 10),
    (114, 'Den', 'Raphaely', 'den.raphaely@sqltutorial.org', '515.127.4561', '1994-12-07', 14, 11000.00, 100, 3),
    (115, 'Alexander', 'Khoo', 'alexander.khoo@sqltutorial.org', '515.127.4562', '1995-05-18', 13, 3100.00, 114, 3),
    (116, 'Shelli', 'Baida', 'shelli.baida@sqltutorial.org', '515.127.4563', '1997-12-24', 13, 2900.00, 114, 3),
    (117, 'Sigal', 'Tobias', 'sigal.tobias@sqltutorial.org', '515.127.4564', '1997-07-24', 13, 2800.00, 114, 3),
    (118, 'Guy', 'Himuro', 'guy.himuro@sqltutorial.org', '515.127.4565', '1998-11-15', 13, 2600.00, 114, 3),
    (119, 'Karen', 'Colmenares', 'karen.colmenares@sqltutorial.org', '515.127.4566', '1999-08-10', 13, 2500.00, 114, 3),
    (120, 'Matthew', 'Weiss', 'matthew.weiss@sqltutorial.org', '650.123.1234', '1996-07-18', 19, 8000.00, 100, 5),
    (121, 'Adam', 'Fripp', 'adam.fripp@sqltutorial.org', '650.123.2234', '1997-04-10', 19, 8200.00, 100, 5),
    (122, 'Payam', 'Kaufling', 'payam.kaufling@sqltutorial.org', '650.123.3234', '1995-05-01', 19, 7900.00, 100, 5),
    (123, 'Shanta', 'Vollman', 'shanta.vollman@sqltutorial.org', '650.123.4234', '1997-10-10', 19, 6500.00, 100, 5),
    (126, 'Irene', 'Mikkilineni', 'irene.mikkilineni@sqltutorial.org', '650.124.1224', '1998-09-28', 18, 2700.00, 120, 5),
    (145, 'John', 'Russell', 'john.russell@sqltutorial.org', None, '1996-10-01', 15, 14000.00, 100, 8),
    (146, 'Karen', 'Partners', 'karen.partners@sqltutorial.org', None, '1997-01-05', 15, 13500.00, 100, 8),
    (176, 'Jonathon', 'Taylor', 'jonathon.taylor@sqltutorial.org', None, '1998-03-24', 16, 8600.00, 100, 8),
    (177, 'Jack', 'Livingston', 'jack.livingston@sqltutorial.org', None, '1998-04-23', 16, 8400.00, 100, 8),
    (178, 'Kimberely', 'Grant', 'kimberely.grant@sqltutorial.org', None, '1999-05-24', 16, 7000.00, 100, 8),
    (179, 'Charles', 'Johnson', 'charles.johnson@sqltutorial.org', None, '2000-01-04', 16, 6200.00, 100, 8),
    (192, 'Sarah', 'Bell', 'sarah.bell@sqltutorial.org', '650.501.1876', '1996-02-04', 17, 4000.00, 123, 5),
    (193, 'Britney', 'Everett', 'britney.everett@sqltutorial.org', '650.501.2876', '1997-03-03', 17, 3900.00, 123, 5),
    (200, 'Jennifer', 'Whalen', 'jennifer.whalen@sqltutorial.org', '515.123.4444', '1987-09-17', 3, 4400.00, 101, 1),
    (201, 'Michael', 'Hartstein', 'michael.hartstein@sqltutorial.org', '515.123.5555', '1996-02-17', 10, 13000.00, 100, 2),
    (202, 'Pat', 'Fay', 'pat.fay@sqltutorial.org', '603.123.6666', '1997-08-17', 11, 6000.00, 201, 2),
    (203, 'Susan', 'Mavris', 'susan.mavris@sqltutorial.org', '515.123.7777', '1994-06-07', 8, 6500.00, 101, 4),
    (204, 'Hermann', 'Baer', 'hermann.baer@sqltutorial.org', '515.123.8888', '1994-06-07', 12, 10000.00, 101, 7),
    (205, 'Shelley', 'Higgins', 'shelley.higgins@sqltutorial.org', '515.123.8080', '1994-06-07', 2, 12000.00, 101, 11),
    (206, 'William', 'Gietz', 'william.gietz@sqltutorial.org', '515.123.8181', '1994-06-07', 1, 8300.00, 205, 11)
]

# Loop through the employees list and execute the INSERT query
for employee in employees:
    c.execute("""
        INSERT INTO employees (
            employee_id, first_name, last_name, email, phone_number, hire_date, job_id, salary, manager_id, department_id
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?);
    """, employee)

### Dependents

In [62]:
dependents = [
    (1, 'Penelope', 'Gietz', 'Child', 206),
    (2, 'Nick', 'Higgins', 'Child', 205),
    (3, 'Ed', 'Whalen', 'Child', 200),
    (4, 'Jennifer', 'King', 'Child', 100),
    (5, 'Johnny', 'Kochhar', 'Child', 101),
    (6, 'Bette', 'De Haan', 'Child', 102),
    (7, 'Grace', 'Faviet', 'Child', 109),
    (8, 'Matthew', 'Chen', 'Child', 110),
    (9, 'Joe', 'Sciarra', 'Child', 111),
    (10, 'Christian', 'Urman', 'Child', 112),
    (11, 'Zero', 'Popp', 'Child', 113),
    (12, 'Karl', 'Greenberg', 'Child', 108),
    (13, 'Uma', 'Mavris', 'Child', 203),
    (14, 'Vivien', 'Hunold', 'Child', 103),
    (15, 'Cuba', 'Ernst', 'Child', 104),
    (16, 'Fred', 'Austin', 'Child', 105),
    (17, 'Helen', 'Pataballa', 'Child', 106),
    (18, 'Dan', 'Lorentz', 'Child', 107),
    (19, 'Bob', 'Hartstein', 'Child', 201),
    (20, 'Lucille', 'Fay', 'Child', 202),
    (21, 'Kirsten', 'Baer', 'Child', 204),
    (22, 'Elvis', 'Khoo', 'Child', 115),
    (23, 'Sandra', 'Baida', 'Child', 116),
    (24, 'Cameron', 'Tobias', 'Child', 117),
    (25, 'Kevin', 'Himuro', 'Child', 118),
    (26, 'Rip', 'Colmenares', 'Child', 119),
    (27, 'Julia', 'Raphaely', 'Child', 114),
    (28, 'Woody', 'Russell', 'Child', 145),
    (29, 'Alec', 'Partners', 'Child', 146),
    (30, 'Sandra', 'Taylor', 'Child', 176)
]

for dependent in dependents:
       c.execute("""
        INSERT INTO dependents (dependent_id,first_name,last_name,relationship,employee_id) VALUES (?, ?, ?, ?, ?);
    """, dependent)

## Select

 Create a function to fetch records from the tables

In [63]:
def get_employee():
  c.execute('''select * from employees;''')
  data = []
  for row in c.fetchall():
      data.append(row)
  return data

In [64]:
def get_job():
   c.execute('''select * from jobs where job_id in (2, 7, 12);''')
   data = []
   for row in c.fetchall():
      data.append(row)
   return data

Method 1 - Use the defined function

In [65]:
print(get_employee())

[(100, 'Steven', 'King', 'steven.king@sqltutorial.org', '515.123.4567', '1987-06-17', 4, 24000, None, 9), (101, 'Neena', 'Kochhar', 'neena.kochhar@sqltutorial.org', '515.123.4568', '1989-09-21', 5, 17000, 100, 9), (102, 'Lex', 'De Haan', 'lex.de haan@sqltutorial.org', '515.123.4569', '1993-01-13', 5, 17000, 100, 9), (103, 'Alexander', 'Hunold', 'alexander.hunold@sqltutorial.org', '590.423.4567', '1990-01-03', 9, 9000, 102, 6), (104, 'Bruce', 'Ernst', 'bruce.ernst@sqltutorial.org', '590.423.4568', '1991-05-21', 9, 6000, 103, 6), (105, 'David', 'Austin', 'david.austin@sqltutorial.org', '590.423.4569', '1997-06-25', 9, 4800, 103, 6), (106, 'Valli', 'Pataballa', 'valli.pataballa@sqltutorial.org', '590.423.4560', '1998-02-05', 9, 4800, 103, 6), (107, 'Diana', 'Lorentz', 'diana.lorentz@sqltutorial.org', '590.423.5567', '1999-02-07', 9, 4200, 103, 6), (108, 'Nancy', 'Greenberg', 'nancy.greenberg@sqltutorial.org', '515.124.4569', '1994-08-17', 7, 12000, 101, 10), (109, 'Daniel', 'Faviet', 'daniel.faviet@sqltutorial.org', '515.124.4169', '1994-08-16', 6, 9000, 108, 10), (110, 'John', 'Chen', 'john.chen@sqltutorial.org', '515.124.4269', '1997-09-28', 6, 8200, 108, 10), (111, 'Ismael', 'Sciarra', 'ismael.sciarra@sqltutorial.org', '515.124.4369', '1997-09-30', 6, 7700, 108, 10), (112, 'Jose Manuel', 'Urman', 'jose manuel.urman@sqltutorial.org', '515.124.4469', '1998-03-07', 6, 7800, 108, 10), (113, 'Luis', 'Popp', 'luis.popp@sqltutorial.org', '515.124.4567', '1999-12-07', 6, 6900, 108, 10), (114, 'Den', 'Raphaely', 'den.raphaely@sqltutorial.org', '515.127.4561', '1994-12-07', 14, 11000, 100, 3), (115, 'Alexander', 'Khoo', 'alexander.khoo@sqltutorial.org', '515.127.4562', '1995-05-18', 13, 3100, 114, 3), (116, 'Shelli', 'Baida', 'shelli.baida@sqltutorial.org', '515.127.4563', '1997-12-24', 13, 2900, 114, 3), (117, 'Sigal', 'Tobias', 'sigal.tobias@sqltutorial.org', '515.127.4564', '1997-07-24', 13, 2800, 114, 3), (118, 'Guy', 'Himuro', 'guy.himuro@sqltutorial.org', '515.127.4565', '1998-11-15', 13, 2600, 114, 3), (119, 'Karen', 'Colmenares', 'karen.colmenares@sqltutorial.org', '515.127.4566', '1999-08-10', 13, 2500, 114, 3), (120, 'Matthew', 'Weiss', 'matthew.weiss@sqltutorial.org', '650.123.1234', '1996-07-18', 19, 8000, 100, 5), (121, 'Adam', 'Fripp', 'adam.fripp@sqltutorial.org', '650.123.2234', '1997-04-10', 19, 8200, 100, 5), (122, 'Payam', 'Kaufling', 'payam.kaufling@sqltutorial.org', '650.123.3234', '1995-05-01', 19, 7900, 100, 5), (123, 'Shanta', 'Vollman', 'shanta.vollman@sqltutorial.org', '650.123.4234', '1997-10-10', 19, 6500, 100, 5), (126, 'Irene', 'Mikkilineni', 'irene.mikkilineni@sqltutorial.org', '650.124.1224', '1998-09-28', 18, 2700, 120, 5), (145, 'John', 'Russell', 'john.russell@sqltutorial.org', None, '1996-10-01', 15, 14000, 100, 8), (146, 'Karen', 'Partners', 'karen.partners@sqltutorial.org', None, '1997-01-05', 15, 13500, 100, 8), (176, 'Jonathon', 'Taylor', 'jonathon.taylor@sqltutorial.org', None, '1998-03-24', 16, 8600, 100, 8), (177, 'Jack', 'Livingston', 'jack.livingston@sqltutorial.org', None, '1998-04-23', 16, 8400, 100, 8), (178, 'Kimberely', 'Grant', 'kimberely.grant@sqltutorial.org', None, '1999-05-24', 16, 7000, 100, 8), (179, 'Charles', 'Johnson', 'charles.johnson@sqltutorial.org', None, '2000-01-04', 16, 6200, 100, 8), (192, 'Sarah', 'Bell', 'sarah.bell@sqltutorial.org', '650.501.1876', '1996-02-04', 17, 4000, 123, 5), (193, 'Britney', 'Everett', 'britney.everett@sqltutorial.org', '650.501.2876', '1997-03-03', 17, 3900, 123, 5), (200, 'Jennifer', 'Whalen', 'jennifer.whalen@sqltutorial.org', '515.123.4444', '1987-09-17', 3, 4400, 101, 1), (201, 'Michael', 'Hartstein', 'michael.hartstein@sqltutorial.org', '515.123.5555', '1996-02-17', 10, 13000, 100, 2), (202, 'Pat', 'Fay', 'pat.fay@sqltutorial.org', '603.123.6666', '1997-08-17', 11, 6000, 201, 2), (203, 'Susan', 'Mavris', 'susan.mavris@sqltutorial.org', '515.123.7777', '1994-06-07', 8, 6500, 101, 4), (204, 'Hermann', 'Baer', 'hermann.baer@sqltutorial.org', '515.123.8888', '1994-06-07', 12, 10000, 101, 7), (205, 'Shelley', 'Higgins', 'shelley.higgins@sqltutorial.org', '515.123.8080', '1994-06-07', 2, 12000, 101, 11), (206, 'William', 'Gietz', 'william.gietz@sqltutorial.org', '515.123.8181', '1994-06-07', 1, 8300, 205, 11)]

In [66]:
print(get_job())

[(2, 'Accounting Manager', 8200, 16000), (7, 'Finance Manager', 8200, 16000), (12, 'Public Relations Representative', 4500, 10500)]

 Method 2 - Use for loop

In [67]:
for row in c.execute('''select * from regions;'''):
    print(row)

(1, 'Europe')
(2, 'Americas')
(3, 'Asia')
(4, 'Middle East and Africa')

In [68]:
for row in c.execute('''select * from countries ORDER BY country_id LIMIT 10;'''):
    print(row)

('AR', 'Argentina', 2)
('AU', 'Australia', 3)
('BE', 'Belgium', 1)
('BR', 'Brazil', 2)
('CA', 'Canada', 2)
('CH', 'Switzerland', 1)
('CN', 'China', 3)
('DE', 'Germany', 1)
('DK', 'Denmark', 1)
('EG', 'Egypt', 4)

In [69]:
for row in c.execute('''select * from locations where location_id in (1400, 2500);'''):
    print(row)

(1400, '2014 Jabberwocky Rd', '26192', 'Southlake', 'Texas', 'US')
(2500, 'Magdalen Centre, The Oxford Science Park', 'OX9 9ZB', 'Oxford', 'Oxford', 'UK')

In [70]:
for row in c.execute('''select * from departments where department_name = 'Marketing';'''):
    print(row)

(2, 'Marketing', 1800)

In [71]:
for row in c.execute('''select * from employees;'''):
    print(row)

(100, 'Steven', 'King', 'steven.king@sqltutorial.org', '515.123.4567', '1987-06-17', 4, 24000, None, 9)
(101, 'Neena', 'Kochhar', 'neena.kochhar@sqltutorial.org', '515.123.4568', '1989-09-21', 5, 17000, 100, 9)
(102, 'Lex', 'De Haan', 'lex.de haan@sqltutorial.org', '515.123.4569', '1993-01-13', 5, 17000, 100, 9)
(103, 'Alexander', 'Hunold', 'alexander.hunold@sqltutorial.org', '590.423.4567', '1990-01-03', 9, 9000, 102, 6)
(104, 'Bruce', 'Ernst', 'bruce.ernst@sqltutorial.org', '590.423.4568', '1991-05-21', 9, 6000, 103, 6)
(105, 'David', 'Austin', 'david.austin@sqltutorial.org', '590.423.4569', '1997-06-25', 9, 4800, 103, 6)
(106, 'Valli', 'Pataballa', 'valli.pataballa@sqltutorial.org', '590.423.4560', '1998-02-05', 9, 4800, 103, 6)
(107, 'Diana', 'Lorentz', 'diana.lorentz@sqltutorial.org', '590.423.5567', '1999-02-07', 9, 4200, 103, 6)
(108, 'Nancy', 'Greenberg', 'nancy.greenberg@sqltutorial.org', '515.124.4569', '1994-08-17', 7, 12000, 101, 10)
(109, 'Daniel', 'Faviet', 'daniel.faviet@sqltutorial.org', '515.124.4169', '1994-08-16', 6, 9000, 108, 10)
(110, 'John', 'Chen', 'john.chen@sqltutorial.org', '515.124.4269', '1997-09-28', 6, 8200, 108, 10)
(111, 'Ismael', 'Sciarra', 'ismael.sciarra@sqltutorial.org', '515.124.4369', '1997-09-30', 6, 7700, 108, 10)
(112, 'Jose Manuel', 'Urman', 'jose manuel.urman@sqltutorial.org', '515.124.4469', '1998-03-07', 6, 7800, 108, 10)
(113, 'Luis', 'Popp', 'luis.popp@sqltutorial.org', '515.124.4567', '1999-12-07', 6, 6900, 108, 10)
(114, 'Den', 'Raphaely', 'den.raphaely@sqltutorial.org', '515.127.4561', '1994-12-07', 14, 11000, 100, 3)
(115, 'Alexander', 'Khoo', 'alexander.khoo@sqltutorial.org', '515.127.4562', '1995-05-18', 13, 3100, 114, 3)
(116, 'Shelli', 'Baida', 'shelli.baida@sqltutorial.org', '515.127.4563', '1997-12-24', 13, 2900, 114, 3)
(117, 'Sigal', 'Tobias', 'sigal.tobias@sqltutorial.org', '515.127.4564', '1997-07-24', 13, 2800, 114, 3)
(118, 'Guy', 'Himuro', 'guy.himuro@sqltutorial.org', '515.127.4565', '1998-11-15', 13, 2600, 114, 3)
(119, 'Karen', 'Colmenares', 'karen.colmenares@sqltutorial.org', '515.127.4566', '1999-08-10', 13, 2500, 114, 3)
(120, 'Matthew', 'Weiss', 'matthew.weiss@sqltutorial.org', '650.123.1234', '1996-07-18', 19, 8000, 100, 5)
(121, 'Adam', 'Fripp', 'adam.fripp@sqltutorial.org', '650.123.2234', '1997-04-10', 19, 8200, 100, 5)
(122, 'Payam', 'Kaufling', 'payam.kaufling@sqltutorial.org', '650.123.3234', '1995-05-01', 19, 7900, 100, 5)
(123, 'Shanta', 'Vollman', 'shanta.vollman@sqltutorial.org', '650.123.4234', '1997-10-10', 19, 6500, 100, 5)
(126, 'Irene', 'Mikkilineni', 'irene.mikkilineni@sqltutorial.org', '650.124.1224', '1998-09-28', 18, 2700, 120, 5)
(145, 'John', 'Russell', 'john.russell@sqltutorial.org', None, '1996-10-01', 15, 14000, 100, 8)
(146, 'Karen', 'Partners', 'karen.partners@sqltutorial.org', None, '1997-01-05', 15, 13500, 100, 8)
(176, 'Jonathon', 'Taylor', 'jonathon.taylor@sqltutorial.org', None, '1998-03-24', 16, 8600, 100, 8)
(177, 'Jack', 'Livingston', 'jack.livingston@sqltutorial.org', None, '1998-04-23', 16, 8400, 100, 8)
(178, 'Kimberely', 'Grant', 'kimberely.grant@sqltutorial.org', None, '1999-05-24', 16, 7000, 100, 8)
(179, 'Charles', 'Johnson', 'charles.johnson@sqltutorial.org', None, '2000-01-04', 16, 6200, 100, 8)
(192, 'Sarah', 'Bell', 'sarah.bell@sqltutorial.org', '650.501.1876', '1996-02-04', 17, 4000, 123, 5)
(193, 'Britney', 'Everett', 'britney.everett@sqltutorial.org', '650.501.2876', '1997-03-03', 17, 3900, 123, 5)
(200, 'Jennifer', 'Whalen', 'jennifer.whalen@sqltutorial.org', '515.123.4444', '1987-09-17', 3, 4400, 101, 1)
(201, 'Michael', 'Hartstein', 'michael.hartstein@sqltutorial.org', '515.123.5555', '1996-02-17', 10, 13000, 100, 2)
(202, 'Pat', 'Fay', 'pat.fay@sqltutorial.org', '603.123.6666', '1997-08-17', 11, 6000, 201, 2)
(203, 'Susan', 'Mavris', 'susan.mavris@sqltutorial.org', '515.123.7777', '1994-06-07', 8, 6500, 101, 4)
(204, 'Hermann', 'Baer', 'hermann.baer@sqltutorial.org', '515.123.8888', '1994-06-07', 12, 10000, 101, 7)
(205, 'Shelley', 'Higgins', 'shelley.higgins@sqltutorial.org', '515.123.8080', '1994-06-07', 2, 12000, 101, 11)
(206, 'William', 'Gietz', 'william.gietz@sqltutorial.org', '515.123.8181', '1994-06-07', 1, 8300, 205, 11)

In [72]:
for row in c.execute('''select * from employees where employee_id <= 111;'''):
    print(row)

(100, 'Steven', 'King', 'steven.king@sqltutorial.org', '515.123.4567', '1987-06-17', 4, 24000, None, 9)
(101, 'Neena', 'Kochhar', 'neena.kochhar@sqltutorial.org', '515.123.4568', '1989-09-21', 5, 17000, 100, 9)
(102, 'Lex', 'De Haan', 'lex.de haan@sqltutorial.org', '515.123.4569', '1993-01-13', 5, 17000, 100, 9)
(103, 'Alexander', 'Hunold', 'alexander.hunold@sqltutorial.org', '590.423.4567', '1990-01-03', 9, 9000, 102, 6)
(104, 'Bruce', 'Ernst', 'bruce.ernst@sqltutorial.org', '590.423.4568', '1991-05-21', 9, 6000, 103, 6)
(105, 'David', 'Austin', 'david.austin@sqltutorial.org', '590.423.4569', '1997-06-25', 9, 4800, 103, 6)
(106, 'Valli', 'Pataballa', 'valli.pataballa@sqltutorial.org', '590.423.4560', '1998-02-05', 9, 4800, 103, 6)
(107, 'Diana', 'Lorentz', 'diana.lorentz@sqltutorial.org', '590.423.5567', '1999-02-07', 9, 4200, 103, 6)
(108, 'Nancy', 'Greenberg', 'nancy.greenberg@sqltutorial.org', '515.124.4569', '1994-08-17', 7, 12000, 101, 10)
(109, 'Daniel', 'Faviet', 'daniel.faviet@sqltutorial.org', '515.124.4169', '1994-08-16', 6, 9000, 108, 10)
(110, 'John', 'Chen', 'john.chen@sqltutorial.org', '515.124.4269', '1997-09-28', 6, 8200, 108, 10)
(111, 'Ismael', 'Sciarra', 'ismael.sciarra@sqltutorial.org', '515.124.4369', '1997-09-30', 6, 7700, 108, 10)

In [73]:
for row in c.execute('''select * from dependents where relationship = 'Child';'''):
    print(row)

(1, 'Penelope', 'Gietz', 'Child', 206)
(2, 'Nick', 'Higgins', 'Child', 205)
(3, 'Ed', 'Whalen', 'Child', 200)
(4, 'Jennifer', 'King', 'Child', 100)
(5, 'Johnny', 'Kochhar', 'Child', 101)
(6, 'Bette', 'De Haan', 'Child', 102)
(7, 'Grace', 'Faviet', 'Child', 109)
(8, 'Matthew', 'Chen', 'Child', 110)
(9, 'Joe', 'Sciarra', 'Child', 111)
(10, 'Christian', 'Urman', 'Child', 112)
(11, 'Zero', 'Popp', 'Child', 113)
(12, 'Karl', 'Greenberg', 'Child', 108)
(13, 'Uma', 'Mavris', 'Child', 203)
(14, 'Vivien', 'Hunold', 'Child', 103)
(15, 'Cuba', 'Ernst', 'Child', 104)
(16, 'Fred', 'Austin', 'Child', 105)
(17, 'Helen', 'Pataballa', 'Child', 106)
(18, 'Dan', 'Lorentz', 'Child', 107)
(19, 'Bob', 'Hartstein', 'Child', 201)
(20, 'Lucille', 'Fay', 'Child', 202)
(21, 'Kirsten', 'Baer', 'Child', 204)
(22, 'Elvis', 'Khoo', 'Child', 115)
(23, 'Sandra', 'Baida', 'Child', 116)
(24, 'Cameron', 'Tobias', 'Child', 117)
(25, 'Kevin', 'Himuro', 'Child', 118)
(26, 'Rip', 'Colmenares', 'Child', 119)
(27, 'Julia', 'Raphaely', 'Child', 114)
(28, 'Woody', 'Russell', 'Child', 145)
(29, 'Alec', 'Partners', 'Child', 146)
(30, 'Sandra', 'Taylor', 'Child', 176)

In [74]:
for row in c.execute('''select * from countries where country_id in ('AR', 'NL','NG','KW','FR','EG');'''):
    print(row)

('AR', 'Argentina', 2)
('EG', 'Egypt', 4)
('FR', 'France', 1)
('KW', 'Kuwait', 4)
('NG', 'Nigeria', 4)
('NL', 'Netherlands', 1)

In [75]:
for row in c.execute('''select * from jobs where job_id in (1, 4, 10, 15, 19);'''):
    print(row)

(1, 'Public Accountant', 4200, 9000)
(4, 'President', 20000, 40000)
(10, 'Marketing Manager', 9000, 15000)
(15, 'Sales Manager', 10000, 20000)
(19, 'Stock Manager', 5500, 8500)

In [76]:
for row in c.execute('''select count (*) from regions;'''):
    print(row)

(4,)

In [77]:
for row in c.execute('''select count (*) from dependents ;'''):
    print(row)

(30,)

In [78]:
for row in c.execute('''select count (*) from departments ;'''):
    print(row)

(11,)

## JOIN

In [79]:
def join_table():
   c.execute('''SELECT d.*, e.employee_id, e.first_name, e.last_name
FROM departments d
LEFT JOIN employees e ON d.department_id = e.department_id;''')
   data = []
   for row in c.fetchall():
      data.append(row)
   return data

In [80]:
print(join_table())

[(1, 'Administration', 1700, 200, 'Jennifer', 'Whalen'), (2, 'Marketing', 1800, 201, 'Michael', 'Hartstein'), (2, 'Marketing', 1800, 202, 'Pat', 'Fay'), (3, 'Purchasing', 1700, 114, 'Den', 'Raphaely'), (3, 'Purchasing', 1700, 115, 'Alexander', 'Khoo'), (3, 'Purchasing', 1700, 116, 'Shelli', 'Baida'), (3, 'Purchasing', 1700, 117, 'Sigal', 'Tobias'), (3, 'Purchasing', 1700, 118, 'Guy', 'Himuro'), (3, 'Purchasing', 1700, 119, 'Karen', 'Colmenares'), (4, 'Human Resources', 2400, 203, 'Susan', 'Mavris'), (5, 'Shipping', 1500, 120, 'Matthew', 'Weiss'), (5, 'Shipping', 1500, 121, 'Adam', 'Fripp'), (5, 'Shipping', 1500, 122, 'Payam', 'Kaufling'), (5, 'Shipping', 1500, 123, 'Shanta', 'Vollman'), (5, 'Shipping', 1500, 126, 'Irene', 'Mikkilineni'), (5, 'Shipping', 1500, 192, 'Sarah', 'Bell'), (5, 'Shipping', 1500, 193, 'Britney', 'Everett'), (6, 'IT', 1400, 103, 'Alexander', 'Hunold'), (6, 'IT', 1400, 104, 'Bruce', 'Ernst'), (6, 'IT', 1400, 105, 'David', 'Austin'), (6, 'IT', 1400, 106, 'Valli', 'Pataballa'), (6, 'IT', 1400, 107, 'Diana', 'Lorentz'), (7, 'Public Relations', 2700, 204, 'Hermann', 'Baer'), (8, 'Sales', 2500, 145, 'John', 'Russell'), (8, 'Sales', 2500, 146, 'Karen', 'Partners'), (8, 'Sales', 2500, 176, 'Jonathon', 'Taylor'), (8, 'Sales', 2500, 177, 'Jack', 'Livingston'), (8, 'Sales', 2500, 178, 'Kimberely', 'Grant'), (8, 'Sales', 2500, 179, 'Charles', 'Johnson'), (9, 'Executive', 1700, 100, 'Steven', 'King'), (9, 'Executive', 1700, 101, 'Neena', 'Kochhar'), (9, 'Executive', 1700, 102, 'Lex', 'De Haan'), (10, 'Finance', 1700, 108, 'Nancy', 'Greenberg'), (10, 'Finance', 1700, 109, 'Daniel', 'Faviet'), (10, 'Finance', 1700, 110, 'John', 'Chen'), (10, 'Finance', 1700, 111, 'Ismael', 'Sciarra'), (10, 'Finance', 1700, 112, 'Jose Manuel', 'Urman'), (10, 'Finance', 1700, 113, 'Luis', 'Popp'), (11, 'Accounting', 1700, 205, 'Shelley', 'Higgins'), (11, 'Accounting', 1700, 206, 'William', 'Gietz')]

In [81]:
def join_table2():
   c.execute('''SELECT r.region_name, c.country_name,
   l.street_address, l.postal_code, l.city, l.state_province
FROM regions r
LEFT JOIN countries c ON r.region_id = c.region_id
LEFT JOIN locations l on c.country_id = l.country_id;''')
   data = []
   for row in c.fetchall():
      data.append(row)
   return data

In [82]:
print(join_table2())

[('Europe', 'Belgium', None, None, None, None), ('Europe', 'Switzerland', None, None, None, None), ('Europe', 'Germany', 'Schwanthalerstr. 7031', '80925', 'Munich', 'Bavaria'), ('Europe', 'Denmark', None, None, None, None), ('Europe', 'France', None, None, None, None), ('Europe', 'Italy', None, None, None, None), ('Europe', 'Netherlands', None, None, None, None), ('Europe', 'United Kingdom', '8204 Arthur St', None, 'London', None), ('Europe', 'United Kingdom', 'Magdalen Centre, The Oxford Science Park', 'OX9 9ZB', 'Oxford', 'Oxford'), ('Americas', 'Argentina', None, None, None, None), ('Americas', 'Brazil', None, None, None, None), ('Americas', 'Canada', '147 Spadina Ave', 'M5V 2L7', 'Toronto', 'Ontario'), ('Americas', 'Mexico', None, None, None, None), ('Americas', 'United States of America', '2004 Charade Rd', '98199', 'Seattle', 'Washington'), ('Americas', 'United States of America', '2011 Interiors Blvd', '99236', 'South San Francisco', 'California'), ('Americas', 'United States of America', '2014 Jabberwocky Rd', '26192', 'Southlake', 'Texas'), ('Asia', 'Australia', None, None, None, None), ('Asia', 'China', None, None, None, None), ('Asia', 'HongKong', None, None, None, None), ('Asia', 'India', None, None, None, None), ('Asia', 'Japan', None, None, None, None), ('Asia', 'Singapore', None, None, None, None), ('Middle East and Africa', 'Egypt', None, None, None, None), ('Middle East and Africa', 'Israel', None, None, None, None), ('Middle East and Africa', 'Kuwait', None, None, None, None), ('Middle East and Africa', 'Nigeria', None, None, None, None), ('Middle East and Africa', 'Zambia', None, None, None, None), ('Middle East and Africa', 'Zimbabwe', None, None, None, None)]

### Joining and ouputting the result directly without using a function

In [83]:
for row in c.execute('''SELECT d.*, e.*
FROM departments d
LEFT JOIN employees e ON d.department_id = e.department_id;'''):
    print(row)

(1, 'Administration', 1700, 200, 'Jennifer', 'Whalen', 'jennifer.whalen@sqltutorial.org', '515.123.4444', '1987-09-17', 3, 4400, 101, 1)
(2, 'Marketing', 1800, 201, 'Michael', 'Hartstein', 'michael.hartstein@sqltutorial.org', '515.123.5555', '1996-02-17', 10, 13000, 100, 2)
(2, 'Marketing', 1800, 202, 'Pat', 'Fay', 'pat.fay@sqltutorial.org', '603.123.6666', '1997-08-17', 11, 6000, 201, 2)
(3, 'Purchasing', 1700, 114, 'Den', 'Raphaely', 'den.raphaely@sqltutorial.org', '515.127.4561', '1994-12-07', 14, 11000, 100, 3)
(3, 'Purchasing', 1700, 115, 'Alexander', 'Khoo', 'alexander.khoo@sqltutorial.org', '515.127.4562', '1995-05-18', 13, 3100, 114, 3)
(3, 'Purchasing', 1700, 116, 'Shelli', 'Baida', 'shelli.baida@sqltutorial.org', '515.127.4563', '1997-12-24', 13, 2900, 114, 3)
(3, 'Purchasing', 1700, 117, 'Sigal', 'Tobias', 'sigal.tobias@sqltutorial.org', '515.127.4564', '1997-07-24', 13, 2800, 114, 3)
(3, 'Purchasing', 1700, 118, 'Guy', 'Himuro', 'guy.himuro@sqltutorial.org', '515.127.4565', '1998-11-15', 13, 2600, 114, 3)
(3, 'Purchasing', 1700, 119, 'Karen', 'Colmenares', 'karen.colmenares@sqltutorial.org', '515.127.4566', '1999-08-10', 13, 2500, 114, 3)
(4, 'Human Resources', 2400, 203, 'Susan', 'Mavris', 'susan.mavris@sqltutorial.org', '515.123.7777', '1994-06-07', 8, 6500, 101, 4)
(5, 'Shipping', 1500, 120, 'Matthew', 'Weiss', 'matthew.weiss@sqltutorial.org', '650.123.1234', '1996-07-18', 19, 8000, 100, 5)
(5, 'Shipping', 1500, 121, 'Adam', 'Fripp', 'adam.fripp@sqltutorial.org', '650.123.2234', '1997-04-10', 19, 8200, 100, 5)
(5, 'Shipping', 1500, 122, 'Payam', 'Kaufling', 'payam.kaufling@sqltutorial.org', '650.123.3234', '1995-05-01', 19, 7900, 100, 5)
(5, 'Shipping', 1500, 123, 'Shanta', 'Vollman', 'shanta.vollman@sqltutorial.org', '650.123.4234', '1997-10-10', 19, 6500, 100, 5)
(5, 'Shipping', 1500, 126, 'Irene', 'Mikkilineni', 'irene.mikkilineni@sqltutorial.org', '650.124.1224', '1998-09-28', 18, 2700, 120, 5)
(5, 'Shipping', 1500, 192, 'Sarah', 'Bell', 'sarah.bell@sqltutorial.org', '650.501.1876', '1996-02-04', 17, 4000, 123, 5)
(5, 'Shipping', 1500, 193, 'Britney', 'Everett', 'britney.everett@sqltutorial.org', '650.501.2876', '1997-03-03', 17, 3900, 123, 5)
(6, 'IT', 1400, 103, 'Alexander', 'Hunold', 'alexander.hunold@sqltutorial.org', '590.423.4567', '1990-01-03', 9, 9000, 102, 6)
(6, 'IT', 1400, 104, 'Bruce', 'Ernst', 'bruce.ernst@sqltutorial.org', '590.423.4568', '1991-05-21', 9, 6000, 103, 6)
(6, 'IT', 1400, 105, 'David', 'Austin', 'david.austin@sqltutorial.org', '590.423.4569', '1997-06-25', 9, 4800, 103, 6)
(6, 'IT', 1400, 106, 'Valli', 'Pataballa', 'valli.pataballa@sqltutorial.org', '590.423.4560', '1998-02-05', 9, 4800, 103, 6)
(6, 'IT', 1400, 107, 'Diana', 'Lorentz', 'diana.lorentz@sqltutorial.org', '590.423.5567', '1999-02-07', 9, 4200, 103, 6)
(7, 'Public Relations', 2700, 204, 'Hermann', 'Baer', 'hermann.baer@sqltutorial.org', '515.123.8888', '1994-06-07', 12, 10000, 101, 7)
(8, 'Sales', 2500, 145, 'John', 'Russell', 'john.russell@sqltutorial.org', None, '1996-10-01', 15, 14000, 100, 8)
(8, 'Sales', 2500, 146, 'Karen', 'Partners', 'karen.partners@sqltutorial.org', None, '1997-01-05', 15, 13500, 100, 8)
(8, 'Sales', 2500, 176, 'Jonathon', 'Taylor', 'jonathon.taylor@sqltutorial.org', None, '1998-03-24', 16, 8600, 100, 8)
(8, 'Sales', 2500, 177, 'Jack', 'Livingston', 'jack.livingston@sqltutorial.org', None, '1998-04-23', 16, 8400, 100, 8)
(8, 'Sales', 2500, 178, 'Kimberely', 'Grant', 'kimberely.grant@sqltutorial.org', None, '1999-05-24', 16, 7000, 100, 8)
(8, 'Sales', 2500, 179, 'Charles', 'Johnson', 'charles.johnson@sqltutorial.org', None, '2000-01-04', 16, 6200, 100, 8)
(9, 'Executive', 1700, 100, 'Steven', 'King', 'steven.king@sqltutorial.org', '515.123.4567', '1987-06-17', 4, 24000, None, 9)
(9, 'Executive', 1700, 101, 'Neena', 'Kochhar', 'neena.kochhar@sqltutorial.org', '515.123.4568', '1989-09-21', 5, 17000, 100, 9)
(9, 'Executive', 1700, 102, 'Lex', 'De Haan', 'lex.de haan@sqltutorial.org', '515.123.4569', '1993-01-13', 5, 17000, 100, 9)
(10, 'Finance', 1700, 108, 'Nancy', 'Greenberg', 'nancy.greenberg@sqltutorial.org', '515.124.4569', '1994-08-17', 7, 12000, 101, 10)
(10, 'Finance', 1700, 109, 'Daniel', 'Faviet', 'daniel.faviet@sqltutorial.org', '515.124.4169', '1994-08-16', 6, 9000, 108, 10)
(10, 'Finance', 1700, 110, 'John', 'Chen', 'john.chen@sqltutorial.org', '515.124.4269', '1997-09-28', 6, 8200, 108, 10)
(10, 'Finance', 1700, 111, 'Ismael', 'Sciarra', 'ismael.sciarra@sqltutorial.org', '515.124.4369', '1997-09-30', 6, 7700, 108, 10)
(10, 'Finance', 1700, 112, 'Jose Manuel', 'Urman', 'jose manuel.urman@sqltutorial.org', '515.124.4469', '1998-03-07', 6, 7800, 108, 10)
(10, 'Finance', 1700, 113, 'Luis', 'Popp', 'luis.popp@sqltutorial.org', '515.124.4567', '1999-12-07', 6, 6900, 108, 10)
(11, 'Accounting', 1700, 205, 'Shelley', 'Higgins', 'shelley.higgins@sqltutorial.org', '515.123.8080', '1994-06-07', 2, 12000, 101, 11)
(11, 'Accounting', 1700, 206, 'William', 'Gietz', 'william.gietz@sqltutorial.org', '515.123.8181', '1994-06-07', 1, 8300, 205, 11)

In [84]:
for row in c.execute('''SELECT r.region_name, c.country_name,
   l.street_address, l.postal_code, l.city, l.state_province
FROM regions r
LEFT JOIN countries c ON r.region_id = c.region_id
INNER JOIN locations l on c.country_id = l.country_id;'''):
    print(row)

('Americas', 'United States of America', '2014 Jabberwocky Rd', '26192', 'Southlake', 'Texas')
('Americas', 'United States of America', '2011 Interiors Blvd', '99236', 'South San Francisco', 'California')
('Americas', 'United States of America', '2004 Charade Rd', '98199', 'Seattle', 'Washington')
('Americas', 'Canada', '147 Spadina Ave', 'M5V 2L7', 'Toronto', 'Ontario')
('Europe', 'United Kingdom', '8204 Arthur St', None, 'London', None)
('Europe', 'United Kingdom', 'Magdalen Centre, The Oxford Science Park', 'OX9 9ZB', 'Oxford', 'Oxford')
('Europe', 'Germany', 'Schwanthalerstr. 7031', '80925', 'Munich', 'Bavaria')

In [85]:
for row in c.execute('''SELECT e.employee_id, e.first_name || ' ' ||e.last_name as full_name, COUNT(d.relationship)
FROM employees e
LEFT JOIN dependents d ON e.employee_id = d.employee_id
GROUP BY e.employee_id
ORDER BY COUNT(d.relationship);'''):
    print(row)

(120, 'Matthew Weiss', 0)
(121, 'Adam Fripp', 0)
(122, 'Payam Kaufling', 0)
(123, 'Shanta Vollman', 0)
(126, 'Irene Mikkilineni', 0)
(177, 'Jack Livingston', 0)
(178, 'Kimberely Grant', 0)
(179, 'Charles Johnson', 0)
(192, 'Sarah Bell', 0)
(193, 'Britney Everett', 0)
(100, 'Steven King', 1)
(101, 'Neena Kochhar', 1)
(102, 'Lex De Haan', 1)
(103, 'Alexander Hunold', 1)
(104, 'Bruce Ernst', 1)
(105, 'David Austin', 1)
(106, 'Valli Pataballa', 1)
(107, 'Diana Lorentz', 1)
(108, 'Nancy Greenberg', 1)
(109, 'Daniel Faviet', 1)
(110, 'John Chen', 1)
(111, 'Ismael Sciarra', 1)
(112, 'Jose Manuel Urman', 1)
(113, 'Luis Popp', 1)
(114, 'Den Raphaely', 1)
(115, 'Alexander Khoo', 1)
(116, 'Shelli Baida', 1)
(117, 'Sigal Tobias', 1)
(118, 'Guy Himuro', 1)
(119, 'Karen Colmenares', 1)
(145, 'John Russell', 1)
(146, 'Karen Partners', 1)
(176, 'Jonathon Taylor', 1)
(200, 'Jennifer Whalen', 1)
(201, 'Michael Hartstein', 1)
(202, 'Pat Fay', 1)
(203, 'Susan Mavris', 1)
(204, 'Hermann Baer', 1)
(205, 'Shelley Higgins', 1)
(206, 'William Gietz', 1)

In [86]:
for row in c.execute('''SELECT e.employee_id, e.first_name || ' ' ||e.last_name as full_name, COUNT(d.relationship)
FROM employees e
LEFT JOIN dependents d ON e.employee_id = d.employee_id
GROUP BY e.employee_id
HAVING COUNT(d.relationship) > 0
ORDER BY COUNT(d.relationship);'''):
    print(row)

(100, 'Steven King', 1)
(101, 'Neena Kochhar', 1)
(102, 'Lex De Haan', 1)
(103, 'Alexander Hunold', 1)
(104, 'Bruce Ernst', 1)
(105, 'David Austin', 1)
(106, 'Valli Pataballa', 1)
(107, 'Diana Lorentz', 1)
(108, 'Nancy Greenberg', 1)
(109, 'Daniel Faviet', 1)
(110, 'John Chen', 1)
(111, 'Ismael Sciarra', 1)
(112, 'Jose Manuel Urman', 1)
(113, 'Luis Popp', 1)
(114, 'Den Raphaely', 1)
(115, 'Alexander Khoo', 1)
(116, 'Shelli Baida', 1)
(117, 'Sigal Tobias', 1)
(118, 'Guy Himuro', 1)
(119, 'Karen Colmenares', 1)
(145, 'John Russell', 1)
(146, 'Karen Partners', 1)
(176, 'Jonathon Taylor', 1)
(200, 'Jennifer Whalen', 1)
(201, 'Michael Hartstein', 1)
(202, 'Pat Fay', 1)
(203, 'Susan Mavris', 1)
(204, 'Hermann Baer', 1)
(205, 'Shelley Higgins', 1)
(206, 'William Gietz', 1)

In [88]:
for row in c.execute('''SELECT e.employee_id, e.first_name || ' ' ||e.last_name as full_name, COUNT(d.relationship)
FROM employees e
LEFT JOIN dependents d ON e.employee_id = d.employee_id
GROUP BY e.employee_id
HAVING COUNT(d.relationship) < 1
ORDER BY COUNT(d.relationship);'''):
    print(row)

(120, 'Matthew Weiss', 0)
(121, 'Adam Fripp', 0)
(122, 'Payam Kaufling', 0)
(123, 'Shanta Vollman', 0)
(126, 'Irene Mikkilineni', 0)
(177, 'Jack Livingston', 0)
(178, 'Kimberely Grant', 0)
(179, 'Charles Johnson', 0)
(192, 'Sarah Bell', 0)
(193, 'Britney Everett', 0)

## Deleting rows

In [89]:
# Create a function for deleting rows
def delete_dependent(dependent_id):
    c.execute(f"DELETE FROM dependents WHERE dependent_id = {dependent_id};")
    conn.commit()

In [90]:
delete_dependent(1)

In [91]:
# Create a function for deleting rows
def delete_department(department_id):
    c.execute("DELETE FROM dependents WHERE dependent_id = ?", (department_id,))


    conn.commit()

In [92]:
delete_department(5)

Check the tables again to see the number of rows left in the tables after deletion

In [93]:
for row in c.execute('''select count (*) from dependents ;'''):
    print(row)

(28,)

In [94]:
for row in c.execute('''select count (*) from departments ;'''):
    print(row)

(11,)

---
## Connecting to a sqlite database just another way

In [139]:
with sqlite3.connect ('mars_db') as db:
  cursor = db.cursor()

In [119]:
cursor.execute('''CREATE TABLE base (
    base_id INT IDENTITY(1,1) PRIMARY KEY,
    base_name VARCHAR(30),
    founded DATE
);''')

In [125]:
cursor.execute('''CREATE TABLE martian (
    martian_id INT IDENTITY(1,1) PRIMARY KEY,
    first_name VARCHAR(25),
    last_name VARCHAR(25),
    base_id INT,
    super_id INT,
    FOREIGN KEY (base_id)
        REFERENCES base (base_id)
);''')

In [98]:
cursor.execute('''CREATE TABLE visitor (
    visitor_id INT AUTO_INCREMENT PRIMARY KEY,
    host_id INT,
    first_name VARCHAR(25),
    last_name VARCHAR(25),
    FOREIGN KEY (host_id)
        REFERENCES martian (martian_id)
);
''')

In [108]:
cursor.execute('''CREATE TABLE supply (
    supply_id INT INCREMENT(1,1) PRIMARY KEY,
    name VARCHAR(30),
    description TEXT,
    quantity INT
);

''')

In [111]:
cursor.execute('''CREATE TABLE inventory (
    base_id INT,
    supply_id INT,
    quantity INT,
    FOREIGN KEY (base_id)
        REFERENCES base (base_id),
    FOREIGN KEY (supply_id)
        REFERENCES supply (supply_id)
);


''')

In [140]:
cursor.execute('''CREATE TABLE martian_confidential (
    martian_id INT INCREMENT(1,1) PRIMARY KEY,
    first_name VARCHAR(25),
    last_name VARCHAR(25),
    base_id INT,
    super_id INT,
    salary INT,
    dna_id VARCHAR(30),
    FOREIGN KEY (base_id)
        REFERENCES base (base_id)
);
''')

OperationalError: table martian_confidential already exists

---
## Inserting Records

In [121]:
# List of regions as tuples (region_id, region_name)
base = [
    (1, 'Tharsisland', '2037-06-03'),
    (2, 'Valles Marineris 2.0', '2040-12-01'),
    (3, 'Gale Cratertown', '2041-08-15'),
    (4, 'New New New York', '2042-02-10'),
    (5, 'Olympus Mons Spa & Casino', None)
]

# Loop through the regions list and execute the insert query
for b in base:
  cursor.execute('''INSERT INTO base (base_id, base_name, founded) VALUES (?, ?, ?);''', b)
# Commit the changes and close the connection
db.commit()

In [126]:

# List of tuples representing the rows to be inserted
martian = [
    (100, 'Ray', 'Bradbury', 1, None),
    (101, 'John', 'Black', 4, 10),
    (102, 'Samuel', 'Hinkston', 4, 2),
    (103, 'Jeff', 'Spender', 1, 9),
    (104, 'Sam', 'Parkhill', 2, 12),
    (105, 'Elma', 'Parkhill', 3, 8),
    (106, 'Melissa', 'Lewis', 1, 1),
    (107, 'Mark', 'Watney', 3, None),
    (108, 'Beth', 'Johanssen', 1, 1),
    (109, 'Chris', 'Beck', 4, None),
    (110, 'Nathaniel', 'York', 4, 2),
    (111, 'Elon', 'Musk', 2, None),
    (112, 'John', 'Carter', None, 8)
]

# Loop over the values and insert each row
for m in martian:
    cursor.execute(
        '''INSERT INTO martian (martian_id, first_name, last_name, base_id, super_id) VALUES (?, ?, ?, ?, ?)''',
        m
    )

# Commit the changes and close the connection
db.commit()

In [104]:

# List of tuples representing the rows to be inserted
visitor = [
   (1, 7, 'George', 'Ambrose'),
    (2, 1, 'Kris', 'Cardenas'),
    (3, 9, 'Priscilla', 'Lane'),
    (4, 11, 'Jane', 'Thornton'),
    (5, None, 'Doug', 'Stavenger'),
    (6, None, 'Jamie', 'Waterman'),
    (7, 8, 'Martin', 'Humphries')
]

# Loop over the values and insert each row
for v in visitor:
    cursor.execute(
        ''' INSERT INTO visitor (visitor_id, host_id, first_name, last_name) VALUES (?, ?, ?, ?)''',
        v )

# Commit the changes and close the connection
db.commit()

In [141]:
# List of tuples representing the rows to be inserted
supply = [
   (1, 'Solar Panel', 'Standard 1x1 meter cell', 912),
    (2, 'Water Filter', 'This takes things out of your water so it''s drinkable.', 6),
    (3, 'Duct Tape', 'A 10 meter roll of duct tape for ALL your repairs.', 951),
    (4, 'Ketchup', 'It''s ketchup...', 206),
    (5, 'Battery Cell', 'Standard 1000 kAh battery cell for power grid (heavy item).', 17),
    (6, 'USB 6.0 Cable', 'Carbon fiber coated / 15 TBps spool', 42),
    (7, 'Fuzzy Duster', 'It gets dusty around here. Be prepared!', 19),
    (8, 'Mars Bars', 'The ORIGINAL nutirent bar made with the finest bioengineered ingredients.', 3801),
    (9, 'Air Filter', 'Removes 99% of all Martian dust from your ventilation unit.', 23),
    (10, 'Famous Ray''s Frozen Pizza', 'This Martian favorite is covered in all your favorite toppings. 1 flavor only.', 823)
]

# Loop over the values and insert each row
for s in supply:
    cursor.execute('''INSERT INTO supply
    (supply_id, name, description, quantity) VALUES (?, ?, ?, ?)''', s
    )

# Commit the changes and close the connection
db.commit()

In [135]:

# List of tuples representing the rows to be inserted
inventory = [
   (1, 1, 8),
    (1, 3, 5),
    (1, 5, 1),
    (1, 6, 2),
    (1, 8, 12),
    (1, 9, 1),
    (2, 4, 5),
    (2, 8, 62),
    (2, 10, 37),
    (3, 2, 11),
    (3, 7, 2),
    (4, 10, 91)
]

# Loop over the values and insert each row
for i in inventory:
    cursor.execute('''INSERT INTO inventory
    (base_id, supply_id, quantity)
 VALUES (?, ?, ?)''',  i
    )

# Commit the changes and close the connection
db.commit()

In [117]:

# List of tuples representing the rows to be inserted
confidential = [
   (1, 'Ray', 'Bradbury', 1, None, 155900, 'gctaggaatgtagaatctcctgttg'),
    (2, 'John', 'Black', 4, 10, 120100, 'cagttaatggttgaagctggggatt'),
    (3, 'Samuel', 'Hinkston', 4, 2, 110000, 'cgaagcgctagatgctgtgttgtag'),
    (4, 'Jeff', 'Spender', 1, 9, 10000, 'gactaatgtcttcgtggattgcaga'),
    (5, 'Sam', 'Parkhill', 2, 12, 125000, 'gttactttgcgaaagccgtggctac'),
    (6, 'Elma', 'Parkhill', 3, 8, 137000, 'gcaggaatggaagcaactgccatat'),
    (7, 'Melissa', 'Lewis', 1, 1, 145250, 'cttcgatcgtcaatggagttccggac'),
    (8, 'Mark', 'Watney', 3,None, 121100, 'gacacgaggcgaactatgtcgcggc'),
    (9, 'Beth', 'Johanssen', 1, 1, 130000, 'cttagactaggtgtgaaacccgtta'),
    (10, 'Chris', 'Beck', 4, None, 125000, 'gggggggttacgacgaggaatccat'),
    (11, 'Nathaniel', 'York', 4, 2, 105000, 'ggtctccctgggcgggatattggatg'),
    (12, 'Elon', 'Musk', 2, None, 155800, 'atctgcttggatcaatagcgctgcg'),
    (13, 'John', 'Carter', None, 8, 129500, 'ccaatcgtgcgagtcgcgatagtct')
    ]

# Loop over the values and insert each row
for c in confidential:
    cursor.execute('''INSERT INTO martian_confidential
    (martian_id, first_name, last_name, base_id, super_id, salary, dna_id)
 VALUES (?, ?, ?,?,?,?,?)''', c
    )

# Commit the changes and close the connection
db.commit()

---
## SELECT

In [122]:
for row in cursor.execute('''SELECT * FROM base;'''):
    print(row)

(1, 'Tharsisland', '2037-06-03')
(2, 'Valles Marineris 2.0', '2040-12-01')
(3, 'Gale Cratertown', '2041-08-15')
(4, 'New New New York', '2042-02-10')
(5, 'Olympus Mons Spa & Casino', None)

In [123]:
# Alternatively, we could select this way:
cursor.execute('''SELECT * FROM base;''')
for x in cursor.fetchall():
    print(x)

(1, 'Tharsisland', '2037-06-03')
(2, 'Valles Marineris 2.0', '2040-12-01')
(3, 'Gale Cratertown', '2041-08-15')
(4, 'New New New York', '2042-02-10')
(5, 'Olympus Mons Spa & Casino', None)

In [127]:
cursor.execute('''SELECT * FROM martian;''')
for x in cursor.fetchall():
    print(x)

(100, 'Ray', 'Bradbury', 1, None)
(101, 'John', 'Black', 4, 10)
(102, 'Samuel', 'Hinkston', 4, 2)
(103, 'Jeff', 'Spender', 1, 9)
(104, 'Sam', 'Parkhill', 2, 12)
(105, 'Elma', 'Parkhill', 3, 8)
(106, 'Melissa', 'Lewis', 1, 1)
(107, 'Mark', 'Watney', 3, None)
(108, 'Beth', 'Johanssen', 1, 1)
(109, 'Chris', 'Beck', 4, None)
(110, 'Nathaniel', 'York', 4, 2)
(111, 'Elon', 'Musk', 2, None)
(112, 'John', 'Carter', None, 8)

In [130]:
cursor.execute('''SELECT * FROM martian_confidential;''')
for x in cursor.fetchall():
    print(x)

(1, 'Ray', 'Bradbury', 1, None, 155900, 'gctaggaatgtagaatctcctgttg')
(2, 'John', 'Black', 4, 10, 120100, 'cagttaatggttgaagctggggatt')
(3, 'Samuel', 'Hinkston', 4, 2, 110000, 'cgaagcgctagatgctgtgttgtag')
(4, 'Jeff', 'Spender', 1, 9, 10000, 'gactaatgtcttcgtggattgcaga')
(5, 'Sam', 'Parkhill', 2, 12, 125000, 'gttactttgcgaaagccgtggctac')
(6, 'Elma', 'Parkhill', 3, 8, 137000, 'gcaggaatggaagcaactgccatat')
(7, 'Melissa', 'Lewis', 1, 1, 145250, 'cttcgatcgtcaatggagttccggac')
(8, 'Mark', 'Watney', 3, None, 121100, 'gacacgaggcgaactatgtcgcggc')
(9, 'Beth', 'Johanssen', 1, 1, 130000, 'cttagactaggtgtgaaacccgtta')
(10, 'Chris', 'Beck', 4, None, 125000, 'gggggggttacgacgaggaatccat')
(11, 'Nathaniel', 'York', 4, 2, 105000, 'ggtctccctgggcgggatattggatg')
(12, 'Elon', 'Musk', 2, None, 155800, 'atctgcttggatcaatagcgctgcg')
(13, 'John', 'Carter', None, 8, 129500, 'ccaatcgtgcgagtcgcgatagtct')

In [136]:
cursor.execute('''SELECT * FROM inventory WHERE supply_id =3;''')
for x in cursor.fetchall():
    print(x)

(1, 3, 5)

In [142]:
cursor.execute('''SELECT * FROM supply WHERE quantity > 100;''')
for x in cursor.fetchall():
    print(x)
db.close()

(1, 'Solar Panel', 'Standard 1x1 meter cell', 912)
(3, 'Duct Tape', 'A 10 meter roll of duct tape for ALL your repairs.', 951)
(4, 'Ketchup', 'Its ketchup...', 206)
(8, 'Mars Bars', 'The ORIGINAL nutirent bar made with the finest bioengineered ingredients.', 3801)
(10, 'Famous Rays Frozen Pizza', 'This Martian favorite is covered in all your favorite toppings. 1 flavor only.', 823)